def 无聊开头():
    print("这是一个超级无聊的程序，功能只有重复这句话和让你按回车来看到下一句。\n")
    input("现在按下回车以继续。\n")

无聊开头()

def 无聊内容(想说的话):
    print(想说的话)
    input("现在按回车继续！\n")

无聊内容("好吧，其实也不全是重复。但你还是需要按回车。\n")
无聊内容("这又是一句闲聊，依然很无聊，而且还是没有其他功能。\n")
无聊内容("你按了多少次回车？你有数过吗？\n")
无聊内容("顺带一提，如果你去翻源代码的话，你会发现这个超级无聊的程序能当def函数基础教学用。\n")
无聊内容("为了让它简单易懂，我把def函数全部命名成了中文，所以我敲代码的时候切英文符号麻烦死了，自己用的时候不要学习。\n")
无聊内容("你现在还是能看见提示说让你按下回车继续听我说话。但实际上，就算你按回车也不会有更多内容了，因为我不想用print写告别语！所以接下来你按回车的话也不会有下一句了，拜拜！\n")
#def函数能加多个变量，示例在同文件夹的纯练习里