print("你好，新生的魔法少女。你需要一段变身台词才能投入战斗，而我可以帮你想一段。\n")
print("你只需要回答我提出的问题，然后按下回车来确认你的答案。注意：不要带标点符号。\n")
name=input("你叫什么名字？\n")
element=input("你魔法的根源是哪种元素？\n")
belief=input("你信仰什么理念？用一个关键词来回答。\n")
important=input("你为谁而战？\n")
end=input("你希望你的变身台词以哪句话结尾？这句可以带标点。\n")
if end == "":
    choose=input("嗯？没有想说的话吗？\n")
    if any(x in choose for x in ["Not exactly","还有","只是手滑了……","手快了","有","不是的","还有想说的","还有！","还有……","还有呢","还有。","有的","有的兄弟有的","误会啊","顶级手误","手快了啊啊啊","泪，大夫我还有救吗","不是啊（哭）","再给我一次机会吧秋梨膏","其实不然"]):
        end=input("那就再输入一遍吧！\n")
    else:
        print("虽然不太明白……但是好吧，就先不写结尾了。\n")
elif end[-1] not in ".,?!~。，！？——-……":
    end=input("还是加上标点符号比较好吧？再输入一遍吧！\n")
else:
    print("好哦，到这里就差不多完成了。\n")

print("以下是你的变身台词：\n")
print(f"伟大的{element}之力啊，聆听我的召唤！我以{name}的名义，发誓我将坚守{belief}的信条，为守护{important}而战！{end}")